{
  "description": "In the past decades, significant progress has been made in tackling long-standing causality problems, such as discovering causality from observational data and inferring causal effects. Moreover, it has recently been shown that the causal perspective aids in understanding and solving various machine learning problems such as transfer learning, out-of-distribution prediction, disentanglement, representation learning, and adversarial vulnerability. Accordingly, this course is concerned with understanding causality, learning it from observational data, and using it to tackle other learning problems.\n\nThe course covers representations of causal models, how causality is different from association, methods for causal discovery and causal representation learning, and how causality enhances advanced learning tasks, including generative AI.",
  "questions": "We will address the following questions:\n\n- Why is causality essential?\n- How can we learn it, including latent variables, from observational data?\n- How can we make sure the estimated representation is causal?\n- What role does causality play in learning under data heterogeneity?\n- Can causal principles make generative AI more controllable and capable of extrapolation?\n- How can deep learning benefit from a causal perspective?",
  "problems": "Two main causality problems are emphasized:\n\n1. **Causal discovery / causal representation learning.** It is well known that “correlation does not imply causality,” but we will make it more precise by asking what assumptions, what information in the data, and what procedures enable us to successfully recover causal information. Causal relations may happen among the underlying hidden variables—we will also see how to uncover the underlying hidden “causal” variables as well as their causal relations from the measured variables.\n2. **How to properly make use of causal information.** This includes identification of causal effects, counterfactual reasoning, and improving machine learning with causal knowledge.",
  "objectives": "## Course objectives\n\nAs an outcome of this course, participants are expected to:\n\n- Understand how causality is different from association and why it is useful\n- Get familiar with graphical models, causality-related concepts and principles, and emerging approaches to causal discovery or causal representation learning from observational data\n- Be acquainted with the state-of-the-art of causality research in different disciplines\n- Be able to develop suitable methods for causal representation learning or causal discovery and causal inference to address problems in specific domains\n- Properly leverage causality in understanding and solving advanced machine learning and artificial intelligence problems\n- Identify and formulate causal problems in your respective fields, and be able to find potential solutions",
  "materials": "## Course materials\n\nReading materials will be available online or distributed in class. In addition, we will refer to several chapters of the following books frequently (some chapters will be available online):\n\n- Peter Spirtes, Clark Glymour, and Richard Scheines (SGS). **Causation, Prediction, and Search**, 2nd edition. MIT Press, 2000.\n- Judea Pearl. **Causality: Models, Reasoning and Inference**, 2nd edition. Cambridge University Press, 2009.\n- Elias Bareinboim. **Causal Artificial Intelligence: A Roadmap for Building Causally Intelligent Systems.** https://causalai-book.net/"
}
